In [1]:
import numpy as np
import pandas as pd

Your task is to create a new Jupyter Notebook that does all of this and handles a new bit of data.

In your day2-pandas-intro folder, create a new notebook named homework.ipynb.

In the first cell, import pandas as pd and import numpy as np.

Use this data (it has missing values):

Python

# Copy this into a cell
import io

csv_data = """Name,Age,City,Salary
Alice,25,New York,70000
Bob,30,London,85000
Charlie,35,New York,90000
David,40,,110000
Emily,28,Paris,
Fiona,,London,95000
"""

# This magic line reads a string as if it's a file
df = pd.read_csv(io.StringIO(csv_data))

# Run this to see your starting data
print("--- Initial Data ---")
df.info()
In new cells, perform the following tasks:

Display the first 3 rows.

Find the average Salary.

Select and display just the Name and City columns.

Find all employees who live in New York.

Find all employees who are older than 30.

The Salary column has a missing value. Fill it with the mean (average) salary.

The Age column has a missing value. Fill it with the median (middle value) age.

The City column has a missing value. Drop any rows that are still missing a value (which is just the city row).

Display the final, cleaned DataFrame.

Commit your work to GitHub

In [2]:
# Copy this into a cell
import io

csv_data = """Name,Age,City,Salary
Alice,25,New York,70000
Bob,30,London,85000
Charlie,35,New York,90000
David,40,,110000
Emily,28,Paris,
Fiona,,London,95000
"""

# This magic line reads a string as if it's a file
df = pd.read_csv(io.StringIO(csv_data))

# Run this to see your starting data
print("--- Initial Data ---")
df.info()

--- Initial Data ---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     5 non-null      float64
 2   City    5 non-null      object
 3   Salary  5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [ ]:
df.head()

In [5]:
avarage_salary = df['Salary'].mean()
print(f"Average Salary: {avarage_salary}")

Average Salary: 90000.0

In [7]:
df[['Name','City']]

      Name      City
0    Alice  New York
1      Bob    London
2  Charlie  New York
3    David       NaN
4    Emily     Paris
5    Fiona    London

In [8]:
df[df['City']=='New York']

      Name   Age      City   Salary
0    Alice  25.0  New York  70000.0
2  Charlie  35.0  New York  90000.0

In [9]:
df[df['Age']>30]

      Name   Age      City    Salary
2  Charlie  35.0  New York   90000.0
3    David  40.0       NaN  110000.0

In [11]:
median_age = df['Age'].median()
print(f"Median Age: {median_age}")

Median Age: 30.0

In [16]:
df_filled = df.fillna({'Age': median_age, 'Salary': avarage_salary})
print("--- Data after filling missing values ---")
df_filled.info()

--- Data after filling missing values ---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      float64
 2   City    5 non-null      object
 3   Salary  6 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [17]:
df_dropped = df.dropna()
print("--- Data after dropping missing values ---")
df_dropped.info()

--- Data after dropping missing values ---
<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      float64
 2   City    3 non-null      object
 3   Salary  3 non-null      float64
dtypes: float64(2), object(2)
memory usage: 120.0+ bytes

In [18]:
df_dropped.head()

      Name   Age      City   Salary
0    Alice  25.0  New York  70000.0
1      Bob  30.0    London  85000.0
2  Charlie  35.0  New York  90000.0